Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/money_and_tax/tax/income_tax/online_services_for_paye_taxpayers.html.txt.tmx
Source language: en
Languages: ga

source: Online services for PAYE taxpayers
ga: Seirbhísí ar líne do cháiníocóirí ÍMAT

source: If you are a PAYE taxpayer, that is if you have tax deducted from your income by your employer, you can use the PAYE Anytime service and the Jobs and Pensions service from Revenue
ga: Más cáiníocóir ÍMAT thú, is é sin, má asbhaineann d’fhostóir cáin ó d’ioncam, féadfaidh tú an tseirbhís Aon Tráth Aon Lá ÍMAT agus an tseirbhís Phost agus Phinsean ó na Coimisinéirí Ioncaim a úsáid

source: This service is now available through Revenue's myAccount Service
ga: Tá an tseirbhís seo ar fáil anois trí Sheirbhís moChúrsaí na gCoimisinéirí Ioncaim

source: These services are now available through Revenue's myAccount Service which is a single access point for secure online services (excluding ROS)
ga: Tá fáil ar na seirbhísí seo trí Sheirbhís moChúrsaí na gCoimisinéirí Ioncaim, ar pointe rochtana aonair í le haghaidh seirbhísí slána ar líne (gan ROS a áireamh)

source: Revenue’s myAccount Service is for people who are not registered for ROS
ga: Tá Seirbhís moChúrsaí na gCoimisinéirí Ioncaim dírithe ar dhaoine nach bhfuil cláraithe do ROS

source: You can change your contact details, including your address, using myAccount
ga: Féadfaidh tú do shonraí teagmhála a athrú, do sheoladh san áireamh, trí moChúrsaí a úsáid

source: If you are a PAYE taxpayer who is not registered for ROS, you can use the PAYE Anytime service
ga: Más cáiníocóir ÍMAT thú nach bhfuil cláraithe do ROS, féadfaidh tú an tseirbhís Aon Tráth Aon Lá ÍMAT a úsáid

source: Once you have registered, you can:
ga: A luaithe a bhíonn tú cláraithe, féadfaidh tú an méid a leanas a dhéanamh:

source: • View your tax record
ga: • Féachaint ar do thaifead cánach

source: • Claim a wide range of tax credits
ga: • Réimse leathan de chreidmheasanna cánach a éileamh

source: • Apply for refunds of tax including health expenses
ga: • Iarratas a dhéanamh ar aisíocaíochtaí cánach, costais sláinte ina measc

source: • Request a review of tax liability for previous years
ga: • Iarraidh go ndéantar athbhreithniú ar dhliteanas cánach do bhlianta roimhe seo

source: • Re-allocate credits between yourself and your spouse or civil partner
ga: • Creidmheasanna a ath-leithdháileadh idir tú féin agus do chéile nó do pháirtnéir sibhialta

source: • Track correspondence submitted to Revenue
ga: • Comhfhreagras a cuireadh faoi bhráid na gCoimisinéirí Ioncaim a rianú

source: PAYE Anytime is available to customers who merely want access to their tax details
ga: Tá ÍMAT Aon Tráth Aon Lá ar fáil do chustaiméirí nach dteastaíonn uathu ach rochtain a fháil ar a sonraí cánach

source: You do not have to submit transactions electronically if you do not wish to
ga: Ní gá duit idirbhearta a sheoladh ar aghaidh go leictreonach mura mian leat amhlaidh a dhéanamh

source: You do not have to submit paper claims when you submit a transaction through PAYE Anytime
ga: Ní gá duit éilimh ar pháipéar a sheoladh ar aghaidh nuair a sheolann tú idirbheart ar aghaidh trí ÍMAT Aon Tráth Aon Lá

source: However you are obliged to retain receipts for 6 years as Revenue may ask to view them at a later stage
ga: Tá dualgas ort, áfach, chun fáltais a choimeád don tréimhse 6 bliana anuas mar gheall go bhféadfadh na Coimisinéirí Ioncaim iarraidh iad a fheiceáil ag tráth níos déanaí

source: When a transaction is submitted using PAYE Anytime, it will be immediately acknowledged and a permanent record of the transaction will be put in Your Requests History
ga: Nuair a sheoltar idirbheart ar aghaidh trí ÍMAT Aon Tráth Aon Lá a úsáid, aithneofar láithreach é agus cuirfear taifead buan den idirbheart i Do Stair Iarrataí

source: PAYE Anytime is available for the current and previous 4 years
ga: Tá ÍMAT Aon Tráth Aon Lá ar fáil don bhliain reatha agus don tréimhse 4 bliana anuas

source: You can read detailed FAQs on the PAYE Anytime service on Revenue's website
ga: Féadfaidh tú ceisteanna coitianta mionsonraithe faoi sheirbhís ÍMAT Aon Tráth Aon Lá a léamh ar láithreán gréasáin na gCoimisinéirí Ioncaim

source: If you are starting work, the Jobs and Pensions online service allows you to register your new job with Revenue
ga: Má tá tú ag tosú oibre, ceadaíonn an tseirbhís ar líne Phost agus Phinsean duit chun do phost nua a chlárú leis na Coimisinéirí Ioncaim

source: It is also available in ROS
ga: Chomh maith leis sin, tá an tseirbhís ar fáil in ROS

source: It is for people who are:
ga: Tá sí dírithe ar dhaoine:

source: • Starting their first job in the current tax year (including their first ever job in Ireland
ga: • A bhfuil a gcéad phost á thosú acu sa bhliain reatha chánach (a gcéad phost riamh in Éirinn san áireamh)

source: • Changing job and their previous job is no longer on Revenue records
ga: • A bhfuil post á athrú acu agus nach bhfuil an post a bhí acu roimhe seo ar thaifid na gCoimisinéirí Ioncaim a thuilleadh

source: • Starting another in addition to their main job
ga: • A bhfuil post eile á thosú acu, anuas ar a bpríomhphost

source: • Starting to receive payments from a private pension (that is, not a Department of Social Protection pension)
ga: • A bhfuil íocaíochtaí á bhfáil acu le déanaí ó phinsean príobháideach (nach pinsean de chuid na Roinne Coimirce Sóisialaí é)

source: When you have registered the details of your new job or private pension, Revenue will send your employer a tax credit certificate showing the tax credits that your employer deducts from your tax bill
ga: Nuair a chláraigh tú na sonraí faoi do phost nua nó do phinsean príobháideach, seolfaidh na Coimisinéirí Ioncaim deimhniú creidmheasanna cánach chuig d’fhostóir ina léirítear na creidmheasanna cánach a asbhaineann d’fhostóir ó do bhille cánach

source: To access the PAYE Anytime service you must register with Revenue's myAccount Service
ga: Chun rochtain a fháil ar an tseirbhís ÍMAT Aon Tráth Aon Lá, caithfidh tú clárú le Seirbhís moChúrsaí na gCoimisinéirí Ioncaim

source: Detailed FAQs on myAccount are available on Revenue’s website
ga: Tá fáil ar cheisteanna coitianta faoi moChúrsaí ar láithreán gréasáin na gCoimisinéirí Ioncaim

source: For more information and support contact Revenue myAccount help
ga: Chun teacht ar bhreis faisnéise agus tacaíochta, déan teagmháil le cabhair le moChúrsaí na gCoimisinéirí Ioncaim
